PX4/PX4-Autopilot/nuttx/arch/arm/src/stm32/stm32_usbhost.c
  DEBUGASSERT(controller == 0);
  DEBUGASSERT(sizeof(struct stm32_ed_s)  <= STM32_ED_SIZE);
  DEBUGASSERT(sizeof(struct stm32_gtd_s) <= STM32_TD_SIZE);

  /* Initialize the state data structure */

  sem_init(&priv->rhssem,  0, 0);
  sem_init(&priv->exclsem, 0, 1);

#ifndef CONFIG_USBHOST_INT_DISABLE
  priv->ininterval  = MAX_PERINTERVAL;
  priv->outinterval = MAX_PERINTERVAL;
#endif

  /* Enable power by setting PCUSB in the PCONP register.  Disable interrupts
   * because this register may be shared with other drivers.
   */

  flags   = irqsave();
  regval  = stm32_getreg(STM32_SYSCON_PCONP);
  regval |= SYSCON_PCONP_PCUSB;
  stm32_putreg(regval, STM32_SYSCON_PCONP);
  irqrestore(flags);

  /* Enable clocking on USB (USB PLL clocking was initialized in very low-
   * evel clock setup logic (see stm32_clockconfig.c)).  We do still need
   * to set up USBOTG CLKCTRL to enable clocking.
   *
   * NOTE: The PORTSEL clock needs to be enabled only when accessing OTGSTCTRL
   */

  stm32_putreg(STM32_CLKCTRL_ENABLES, STM32_USBOTG_CLKCTRL);

  /* Then wait for the clocks to be reported as "ON" */

  do
    {
      regval = stm32_getreg(STM32_USBOTG_CLKST);
    }
  while ((regval & STM32_CLKCTRL_ENABLES) != STM32_CLKCTRL_ENABLES);

  /* Set the OTG status and control register.  Bits 0:1 apparently mean:
   *
   *   00: U1=device, U2=host
   *   01: U1=host, U2=host
   *   10: reserved
   *   11: U1=host, U2=device
   *
   * We need only select U1=host (Bit 0=1, Bit 1 is not used on STM32);
   * NOTE: The PORTSEL clock needs to be enabled when accessing OTGSTCTRL
   */

  stm32_putreg(1, STM32_USBOTG_STCTRL);

  /* Now we can turn off the PORTSEL clock */

  stm32_putreg((STM32_CLKCTRL_ENABLES & ~USBOTG_CLK_PORTSELCLK), STM32_USBOTG_CLKCTRL);

  /* Configure I/O pins */

  usbhost_dumpgpio();
  stm32_configgpio(GPIO_USB_DP);      /* Positive differential data */
  stm32_configgpio(GPIO_USB_DM);      /* Negative differential data */
  stm32_configgpio(GPIO_USB_UPLED);   /* GoodLink LED control signal */
  stm32_configgpio(GPIO_USB_PPWR);    /* Port Power enable signal for USB port */
  stm32_configgpio(GPIO_USB_PWRD);    /* Power Status for USB port (host power switch) */
  stm32_configgpio(GPIO_USB_OVRCR);   /* USB port Over-Current status */
  usbhost_dumpgpio();

  udbg("Initializing Host Stack\n");

  /* Show AHB SRAM memory map */

#if 0 /* Useful if you have doubts about the layout */
  uvdbg("AHB SRAM:\n");
  uvdbg("  HCCA:   %08x %d\n", STM32_HCCA_BASE,   STM32_HCCA_SIZE);
  uvdbg("  TDTAIL: %08x %d\n", STM32_TDTAIL_ADDR, STM32_TD_SIZE);
  uvdbg("  EDCTRL: %08x %d\n", STM32_EDCTRL_ADDR, STM32_ED_SIZE);
  uvdbg("  EDFREE: %08x %d\n", STM32_EDFREE_BASE, STM32_ED_SIZE);
  uvdbg("  TDFREE: %08x %d\n", STM32_TDFREE_BASE, STM32_EDFREE_SIZE);
  uvdbg("  TBFREE: %08x %d\n", STM32_TBFREE_BASE, STM32_TBFREE_SIZE);
  uvdbg("  IOFREE: %08x %d\n", STM32_IOFREE_BASE, STM32_IOBUFFERS * CONFIG_USBHOST_IOBUFSIZE);
#endif

  /* Initialize all the TDs, EDs and HCCA to 0 */

  memset((void*)HCCA,   0, sizeof(struct ohci_hcca_s));
  memset((void*)TDTAIL, 0, sizeof(struct ohci_gtd_s));
  memset((void*)EDCTRL, 0, sizeof(struct stm32_ed_s));
  sem_init(&EDCTRL->wdhsem, 0, 0);

  /* Initialize user-configurable EDs */

  buffer = (uint8_t *)STM32_EDFREE_BASE;
  for (i = 0; i < CONFIG_USBHOST_NEDS; i++)
    {
      /* Put the ED in a free list */

      stm32_edfree((struct stm32_ed_s *)buffer);
      buffer += STM32_ED_SIZE;
    }

  /* Initialize user-configurable TDs */

  buffer = (uint8_t *)STM32_TDFREE_BASE;
  for (i = 0; i < CONFIG_USBHOST_NTDS; i++)
    {
      /* Put the ED in a free list */

      stm32_tdfree((struct stm32_gtd_s *)buffer);
      buffer += STM32_TD_SIZE;
    }

  /* Initialize user-configurable request/descriptor transfer buffers */

  buffer = (uint8_t *)STM32_TBFREE_BASE;
  for (i = 0; i < CONFIG_USBHOST_TDBUFFERS; i++)
    {
      /* Put the TD buffer in a free list */

      stm32_tbfree(buffer);
      buffer += CONFIG_USBHOST_TDBUFSIZE;
    }

#if STM32_IOBUFFERS > 0
  /* Initialize user-configurable IO buffers */

  buffer = (uint8_t *)STM32_IOFREE_BASE;
  for (i = 0; i < STM32_IOBUFFERS; i++)
    {
      /* Put the IO buffer in a free list */

      stm32_freeio(buffer);
      buffer += CONFIG_USBHOST_IOBUFSIZE;
    }
#endif

  /* Wait 50MS then perform hardware reset */

  up_mdelay(50);

  stm32_putreg(0, STM32_USBHOST_CTRL);        /* Hardware reset */
  stm32_putreg(0, STM32_USBHOST_CTRLHEADED);  /* Initialize control list head to Zero */
  stm32_putreg(0, STM32_USBHOST_BULKHEADED);  /* Initialize bulk list head to Zero */

  /* Software reset */

  stm32_putreg(OHCI_CMDST_HCR, STM32_USBHOST_CMDST);
  
  /* Write Fm interval (FI), largest data packet counter (FSMPS), and
   * periodic start.
   */
  
  stm32_putreg(DEFAULT_FMINTERVAL, STM32_USBHOST_FMINT);
  stm32_putreg(DEFAULT_PERSTART, STM32_USBHOST_PERSTART);

  /* Put HC in operational state */

  regval  = stm32_getreg(STM32_USBHOST_CTRL);
  regval &= ~OHCI_CTRL_HCFS_MASK;
  regval |= OHCI_CTRL_HCFS_OPER;
  stm32_putreg(regval, STM32_USBHOST_CTRL);

  /* Set global power in HcRhStatus */

  stm32_putreg(OHCI_RHSTATUS_SGP, STM32_USBHOST_RHSTATUS);

  /* Set HCCA base address */

  stm32_putreg((uint32_t)HCCA, STM32_USBHOST_HCCA);

  /* Set up EP0 */

  stm32_ep0init(priv);

  /* Clear pending interrupts */

  regval = stm32_getreg(STM32_USBHOST_INTST);
  stm32_putreg(regval, STM32_USBHOST_INTST);

  /* Enable OHCI interrupts */

  stm32_putreg((STM32_ALL_INTS|OHCI_INT_MIE), STM32_USBHOST_INTEN);

  /* Attach USB host controller interrupt handler */

  if (irq_attach(STM32_IRQ_USB, stm32_usbinterrupt) != 0)
    {
      udbg("Failed to attach IRQ\n");
      return NULL;
    }

  /* Enable USB interrupts at the SYCON controller.  Disable interrupts
   * because this register may be shared with other drivers.
   */

  flags   = irqsave();
  regval  = stm32_getreg(STM32_SYSCON_USBINTST);
  regval |= SYSCON_USBINTST_ENINTS;
  stm32_putreg(regval, STM32_SYSCON_USBINTST);
  irqrestore(flags);

  /* If there is a USB device in the slot at power up, then we will not
   * get the status change interrupt to signal us that the device is
   * connected.  We need to set the initial connected state accordingly.
   */

  regval          = stm32_getreg(STM32_USBHOST_RHPORTST1);
  priv->connected = ((regval & OHCI_RHPORTST_CCS) != 0);

  /* Enable interrupts at the interrupt controller */

  up_enable_irq(STM32_IRQ_USB); /* enable USB interrupt */
  udbg("USB host Initialized, Device connected:%s\n",
       priv->connected ? "YES" : "NO");

  return &priv->drvr;
}
